src/test/resources/at/ac/tuwien/wmpm/exampleSOAPRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ss2="http://tuwien.ac.at/wmpm/ss2016">
    <soapenv:Header/>
    <soapenv:Body>
        <ss2:VoteRequest>
            <ss2:personInfo>
                <ss2:votingCard>df85485fe016bd220f6d87485dbab7c3c4bfc243</ss2:votingCard>
                <ss2:personalIdentificationDoc>64abaade7c05afb815c615d3c43509fbd6ebd2ab</ss2:personalIdentificationDoc>
            </ss2:personInfo>
            <ss2:voteInfo>
                <!--Zero or more repetitions:-->
                <ss2:item candiate="Trump" mark="x"  />
                <ss2:item candiate="Homer" mark=""   />
                <ss2:item candiate="Clinton" mark="" />
            </ss2:voteInfo>
        </ss2:VoteRequest>
    </soapenv:Body>
</soapenv:Envelope>